var json={
  code:"请求成功",
  data: [["浦东新区", "黄浦区","徐汇区","长宁区","静安区","普陀区","虹口区","杨浦区","闵行区","宝山区","嘉定区","金山区","松江区","青浦区","奉贤区","崇明岛","通天塔"],
   ["潍坊新村街道","陆家嘴街道","周家渡街道","唐新桥街道","上岗新村街道","南码头路街道","沪东新街道","金阳新村街道","洋泾街道","浦星路街道","东明路街道",
    "花木街道","川沙新镇","高桥镇","北蔡镇","合庆镇","金桥镇","高行镇"]],
   "objectMultiArray": [
    [
      {
        "id": 0,
        "name": "浦东新区"
      },
      {
        "id": 1,
        "name": "黄浦区"
      },
      {
        "id": 2,
        "name": "徐汇区"
      },
      {
        "id": 3,
        "name": "长宁区"
      }, {
        "id": 4,
        "name": "静安区"
      }, {
        "id": 5,
        "name": "普陀区"
      }, {
        "id": 6,
        "name": "虹口区"
      },
      {
        "id": 7,
        "name": "杨浦区"
      },
      {
        "id": 8,
        "name": "闵行区"
      },
      {
        "id": 9,
        "name": "宝山区"
      },{
        "id": 10,
        "name": "嘉定区"
      },{
        "id": 11,
        "name": "金山区"
      },{
        "id": 12,
        "name": "松江区"
      },{
        "id": 13,
        "name": "青浦区"
      },{
        "id": 14,
        "name": "奉贤区"
      },{
        "id": 15,
        "name": "崇明岛"
      },{
        "id": 16,
        "name": "通天塔"
      }
    ], [
      {
        "id": 0,
        "name": "潍坊新村街道"
      },
      {
        "id": 1,
        "name": "陆家嘴街道"
      },
      {
        "id": 2,
        "name": "周家渡街道"
      },
      {
        "id": 3,
        "name": "唐新桥街道"
      },
      {
        "id": 4,
        "name": "上岗新村街道"
      },  {
        "id": 5,
        "name": "南码头路街道"
      },  {
        "id": 6,
        "name": "沪东新街道"
      },  {
        "id": 7,
        "name": "金阳新村街道"
      },  {
        "id": 8,
        "name": "洋泾街道"
      },  {
        "id": 9,
        "name": "浦星路街道"
      },  {
        "id": 10,
        "name": "东明路街道"
      },  {
        "id": 11,
        "name": "花木街道"
      },  {
        "id": 12,
        "name": "川沙新镇"
      },  {
        "id": 13,
        "name": "高桥镇"
      },  {
        "id": 14,
        "name": "北蔡镇"
      },  {
        "id": 15,
        "name": "合庆镇"
      },  {
        "id": 16,
        "name": "金桥镇"
      } , {
        "id": 17,
        "name": "高行镇"
      }
    ]
  ]
}

//定义数据接口
module.exports={
  pickList:json
}